# Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:
# сторона_а (довжина сторони а).
# кут_а (кут між сторонами а і b).
# кут_б (суміжний з кутом кут_а).
# Необхідно реалізувати наступні вимоги:
# 1. Значення сторони сторона_а повинно бути більше 0.
# 2. кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
# 3. Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення кут_б обчислюється автоматично.
# 4. Для встановлення значень атрибутів використовуйте метод __setattr__


class Diamond:
    def __init__(self, side, alpha):
        if side > 0: 
         self.side = side
        else: 
           print ("Sede should be greater than 0")
        if 0 < alpha < 180:
            self.alpha = alpha
            self.beta = 180 - self.alpha
        else:
           print("Angle should be between (0, 180)")
     
d = Diamond(10,60)
print(d.side)
print(d.alpha)
print(d.beta)