# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою.
# Наприклад: ["1, 2, 3, 4", "1, 2, 3, 4, 50", "qwerty1, 2, 3"]
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
# Якщо є символи, що не є числами ("qwerty1, 2, 3" у прикладі), вам потрібно
# зловити вийняток і вивести "Не можу це зробити!"

lst = ["1, 2, 3, 4", "1, 2, 3, 4, 50", "qwerty1, 2, 3"]

def sum_of_the_elements(s):
    try:
        numbers = s.split(",") # Розбиваємо рядок s по комі -> отримуємо список частин (усі ще як рядки)
        #    Напр.: "1, 2, 3" -> ["1", " 2", " 3"]
        return sum(int(n.strip()) for n in numbers) # Для кожної частини n зі списку numbers:
        #    - прибираємо пробіли зліва/справа: n.strip()
        #    - перетворюємо на ціле число: int(...)
        #    - передаємо ці числа в sum(...) і отримуємо їхню суму
    except ValueError:
        return("Не можу це зробити!")

for item in lst:
    print(sum_of_the_elements(item))